---------------------------------------------------------------------
-------------------------NongGust.Shop-------------------------------
---------------------------------------------------------------------
Config = {}
Config["license_key"] = ""                  --[[ ใส่คีย์ ]]
Config.Locale  = 'th'                       --[[ ห้ามแก้ไข ]]
Config.location	= -259.91464233398,-975.15985107422,31.220003128052 
Config.FarfromCity = 2500                   --[[ ระยะในการขโมยปูนจุดกลางคือจ็อบ ]]
Config.Prop = {                             --[[ propปูน ]]
    "prop_cementbags01",
    "prop_cons_cements01"
}


Config.itemuse = 'phone'                    --[[ ชื่อไอเท็มที่จะกดใช้ ]]
Config.Needcop = 0                          --[[ จำนวนตำรวจ ]]
Config.ItemName = 'cements'                 --[[  ไอเท็มที่จะได้รับ ]]
Config.ItemCount = {1,1}                   --[[ จำนวนที่จะได้รับ ]]
Config.mythictime = 25                      --[[ เวลาของหลอดโหลด 1 = 1000 ]]


Config.policenotify = {                     --[[ ส่วนของการแจ้งเตือนตำรวจ ]]
    failMsg = true, --หากเล่นมินิเกมไม่ผ่านจะให้แจ้งตำรวจไหม true = แจ้ง false = ไม่แจ้ง
    alertNet = {    --[[ แจ้งเตือนแถบขวา ใช้ของใครก็ใส่ของค่ายนั้น ]]
        Even = 'maxez-police:alertNet',
        category = 'cement'
    },
    policephone = true, --[[ ให้แจ้งเตื่อนเข้าข้อความของตำรวจหรือไม่ ]]
    policesound = true  --[[ true = เปิดใช้เสียงแจ้งเตือนตำรวจ false = ปิดใช้เสียงแจ้งเตือนตำรวจ ]]
}

Config.Text = {
    nocop = 'ต้องมีตำรวจ จำนวน '..Config.Needcop..' คนขึ้นไป',
}
Config.OpenMiNiGame = true --[[ true = เปิดใช้มินิเกม false = ปิดใช้มินิเกมกดขโมยได้เลย ]]
Config.xzero_skillcheck = {
    textTitle           = "กำลังจกปูน", -- ข้อความที่แสดง
    speedMin            = 15,         -- ความเร็วสุ่มตั้งแต่เท่าไหร่  (ยิ่งน้อยยิ่งเร็ว)
    speedMax            = 20,         -- ความเร็วสุ่มถึงเท่าไหร่    (ยิ่งน้อยยิ่งเร็ว)
    countSuccessMax     = 5,          -- กำหนดจำนวนครั้งที่สำเร็จ (เมื่อถึงเป้าจะ success)
    countFailedMax      = 3,          -- กำหนดจำนวนครั้งที่ล้มเหลว (เมื่อถึงเป้าจะ failed)
}


--------------------------------------------------------------------